-ifndef(cfg_monsterExp_hrl).
-define(cfg_monsterExp_hrl, true).

-record(monsterExpCfg, {
	%% 等级
	%% （如果没找到对应等级，则按照最大等级取值）
	iD,
	%% 引导勇者试炼经验列1
	%% （700只怪，42-49级）
	exp1,
	%% 引导勇者试炼经验列2
	exp2,
	%% 引导勇者试炼经验列3
	exp3,
	%% 引导勇者试炼经验列4
	exp4,
	%% 引导勇者试炼经验列5
	exp5,
	%% 引导勇者试炼经验列6
	exp6,
	%% 引导勇者试炼经验列7
	exp7,
	%% 引导勇者试炼经验列8
	exp8,
	%% 引导勇者试炼经验列9
	exp9,
	%% 引导勇者试炼经验列10
	exp10,
	%% 引导勇者试炼第二波经验列1
	%% （700只怪，42-49级）
	exp11,
	%% 引导勇者试炼第二波经验列2
	exp12,
	%% 引导勇者试炼第二波经验列3
	exp13,
	%% 引导勇者试炼第二波经验列4
	exp14,
	%% 引导勇者试炼第二波经验列5
	exp15,
	%% 引导勇者试炼第二波经验列6
	exp16,
	%% 引导勇者试炼第二波经验列7
	exp17,
	%% 引导勇者试炼第二波经验列8
	exp18,
	%% 引导勇者试炼第二波经验列9
	exp19,
	%% 引导勇者试炼第二波经验列10
	exp20,
	%% 篝火找回经验
	exp21,
	%% 龙王宝库小怪
	exp22,
	%% 龙王宝库精英
	exp23,
	%% 龙王宝库Boss
	exp24,
	%% 坐骑副本小怪
	exp25,
	%% 坐骑副本精英
	exp26,
	%% 坐骑副本Boss
	exp27,
	%% 宠物副本小怪
	%% (没用）
	exp28,
	%% 宠物副本精英
	%% (没用）
	exp29,
	%% 宠物副本boss
	%% (没用）
	exp30,
	%% 翅膀副本小怪
	%% 未使用
	exp31,
	%% 翅膀副本精英
	%% 未使用
	exp32,
	%% 翅膀副本Boss
	%% 未使用
	exp33,
	%% 练功房1星怪物经验(没用）
	exp34,
	%% 练功房2星怪物经验(没用）
	exp35,
	%% 练功房3星怪物经验(没用）
	exp36,
	%% 练功房4星怪物经验(没用）
	exp37,
	%% 练功房5星怪物经验(没用）
	exp38,
	%% 情侣试炼小怪
	exp39,
	%% 情侣试炼精英
	exp40,
	%% 情侣试炼普通boss
	exp41,
	%% 守卫战盟小怪
	exp42,
	%% 守卫战盟Boss
	exp43,
	%% A勇士本经验
	exp44,
	%% S勇士本经验
	exp45,
	%% SS勇士本经验
	exp46,
	%% SSS勇士本经验
	exp47,
	%% A Boss勇士本经验
	exp48,
	%% S Boss勇士本经验
	exp49,
	%% SS Boss勇士本经验
	exp50,
	%% 召唤Boss勇士本经验
	exp51,
	%% A进阶本经验
	exp52,
	%% S进阶本经验
	exp53,
	%% SS进阶本经验
	exp54,
	%% SSS进阶本经验
	exp55,
	%% A Boss进阶本经验
	exp56,
	%% S Boss进阶本经验
	exp57,
	%% SS Boss进阶本经验
	exp58,
	%% 召唤Boss进阶本经验
	exp59,
	%% 引导练功房经验
	exp60,
	%% 龙钻找回：埋骨之地经验列
	exp61,
	%% 钻石找回：埋骨之地经验列
	exp62,
	%% 龙钻找回：地精宝库经验列
	exp63,
	%% 钻石找回：地精宝库经验列
	exp64,
	%% 龙钻找回：坐骑副本经验列
	exp65,
	%% 钻石找回：坐骑副本经验列
	exp66,
	%% 龙钻找回：魔宠副本经验列
	exp67,
	%% 钻石找回：魔宠副本经验列
	exp68,
	%% 龙钻找回：翅膀副本经验列
	exp69,
	%% 钻石找回：翅膀副本经验列
	exp70,
	%% 龙钻找回：战盟篝火经验列
	exp71,
	%% 钻石找回：战盟篝火经验列
	exp72,
	%% 钻石找回：竞技场单场经验列
	exp73,
	%% 龙钻找回：竞技场单场经验列
	exp74,
	%% 龙钻找回：龙神封印勇士本
	exp75,
	%% 钻石找回：龙神封印勇士本
	exp76,
	%% 龙钻找回：龙神封印进阶本
	exp77,
	%% 钻石找回：龙神封印进阶本
	exp78,
	%% 勇者试炼1波怪物经验
	exp79,
	%% 勇者试炼2波怪物经验
	exp80,
	%% 勇者试炼3波怪物经验
	exp81,
	%% 勇者试炼4波怪物经验
	exp82,
	%% 勇者试炼5波怪物经验
	exp83,
	%% 勇者试炼6波怪物经验
	exp84,
	%% 勇者试炼7波怪物经验
	exp85,
	%% 勇者试炼8波怪物经验
	exp86,
	%% 勇者试炼9波怪物经验
	exp87,
	%% 勇者试炼10波怪物经验
	exp88,
	%% 龙神副本小怪未使用
	exp89,
	%% 龙神副本精英未使用
	exp90,
	%% 龙神副本Boss未使用
	exp91,
	%% 封印副本小怪
	%% 二转迷宫1（高经验）
	exp92,
	%% 封印副本精英怪（BOSS无经验）
	%% 二转迷宫1（高经验）
	exp93,
	%% 封印副本小怪
	%% 二转迷宫2（低经验）
	exp94,
	%% 封印副本精英怪（BOSS无经验）
	%% 二转迷宫2（低经验）
	exp95,
	%% 封印副本小怪
	%% 三转迷宫1（高经验）
	exp96,
	%% 封印副本精英怪（BOSS无经验）
	%% 三转迷宫1（高经验）
	exp97,
	%% 封印副本小怪
	%% 三转迷宫2（低经验）
	exp98,
	%% 封印副本精英怪（BOSS无经验）
	%% 三转迷宫2（低经验）
	exp99,
	%% 翅膀副本小怪
	exp100,
	%% 翅膀副本精英
	exp101,
	%% 翅膀副本BOSS
	exp102,
	%% 亡灵墓道
	%% 小怪经验产出
	exp103,
	%% 亡灵墓道
	%% 精英经验产出
	exp104,
	%% 亡灵墓道
	%% BOSS经验产出
	exp105,
	%% 亡灵墓道
	%% 召唤BOSS经验产出
	exp106,
	%% 熔岩角斗场小怪经验
	exp107,
	%% 熔岩角斗场BOSS经验
	exp108,
	%% 翅膀副本扫荡小怪
	exp109,
	%% 翅膀副本扫荡精英
	exp110,
	%% BOSS经验
	exp111,
	%% BOSS经验
	exp112,
	%% BOSS经验
	exp113,
	%% 情侣副本小怪
	exp114,
	%% 情侣副本小怪
	exp115,
	%% 装备副本小怪
	exp116,
	%% 装备副本精英
	exp117
}).

-endif.
