-ifndef(cfg_lordRing_hrl).
-define(cfg_lordRing_hrl, true).

-record(lordRingCfg, {
	%% 魔戒ID
	iD,
	%% 穿戴等级
	level,
	%% 1麻痹戒指，2治疗戒指，3复活戒指，4护身戒指
	part,
	%% 星级
	%% 0-6
	star,
	%% 品质
	%% 0为普通白
	%% 1为优秀蓝
	%% 2为史诗紫
	%% 3为传说橙
	%% 4为神话红
	%% 5为粉色
	%% 6为神装
	quality,
	%% 基础属性
	attribute,
	%% 基础属性评分值
	score,
	%% 卓越属性品质按个数配置
	%% {卓越品质1|卓越品质2|卓越品质3}
	%% 卓越属性1：1
	%% 卓越属性2：2
	%% 卓越属性3：3
	starRule,
	%% 卓越属性1随机属性库
	%% {属性id，值，品质，评分值，权重值}
	%% 品质0白1蓝2紫3橙4红5粉6神
	starAttribute1,
	%% 卓越属性2随机属性库
	%% {属性id，值，品质，评分值，权重值}
	%% 品质0白1蓝2紫3橙4红5粉6神
	starAttribute2,
	%% 卓越属性3随机属性库
	%% {属性id，值，品质，评分值，权重值}
	%% 品质0白1蓝2紫3橙4红5粉6神
	starAttribute3,
	%% 卓越属性3随机属性库
	%% {属性id，值，品质，评分值，权重值}
	%% 品质0白1蓝2紫3橙4红5粉6神
	starAttribute4,
	%% (技能类型,ID,学习位)
	%% 技能类型：
	%% 1为技能(skillBase);
	%% 2为技能修正(SkillCorr)
	%% 学习位：为0时不可直接获
	%% 108-111
	skill
}).

-endif.
