-ifndef(cfg_consumptionTime_hrl).
-define(cfg_consumptionTime_hrl, true).

-record(consumptionTimeCfg, {
	%% 次数型消费类型ID（以全局表功能字段为准）
	%% 1代表剧情副本重置
	%% 2代表大闹天宫副本重置
	%% 3英雄重生
	%% 4装备重生
	%% 5摇钱树元宝花费
	%% 6擂台购买次数花费
	%% 7公会副本购买次数花费
	%% 8世界BOSS购买次数花费
	%% 9世界BOSS购买BUFF1-复活
	%% 10世界BOSS购买BUFF2-元宝
	%% 11神器副本购买次数
	%% 12扫荡值购买单位次数花费
	%% 13探索值购买花费
	%% 14.组队副本购买单位次数花费
	%% 15.家园宝箱钥匙购买单次花费
	%% 16.神器强化后继承单次花费
	%% 17.野外复活花费
	%% 18.个人天魔副本购买单次花费
	%% 19.剑台购买次数花费
	%% 20.宠物副本购买次数花费
	%% 21.坐骑副本购买次数花费
	%% 22.翅膀副本购买次数花费
	%% 23.恶魔广场副本购买花费次数
	%% 24.竞技场购买消耗
	%% 25.精灵宝藏购买次数消耗
	%% 26.龙神秘典副本购买次数消耗
	%% 27.埋骨之地副本购买次数消耗
	%% 28.地精宝库购买次数消耗
	%% 29.圣物副本购买次数消耗
	%% 30.龙神副本购买次数消耗
	%% 31.王者1V1购买次数消耗
	%% 32.情侣试炼购买次数消耗
	%% 实际次数超出配置最大值，按最大值算
	iD,
	%% ID=1,2:第几次重置
	%% ID=3:英雄突破等级
	%% ID=4:装备精炼等级
	%% ID=5:元宝摇钱次数
	%% ID=6:擂台次数购买
	%% ID=16：神器强化等级（最大20级）
	%% ID=33：
	%% 1第一次重置天赋消耗
	%% 2第一次以后重置天赋消耗
	num,
	%% 客户端索引
	index,
	%% 消耗货币类型
	%% 0:绑钻
	%% 11，非绑
	costCurrType,
	%% 消耗量
	costCurrCons
}).

-endif.
