-ifndef(cfg_dungeonEnchantment_hrl).
-define(cfg_dungeonEnchantment_hrl, true).

-record(dungeonEnchantmentCfg, {
	%% 副本ID
	iD,
	%% 副本类型
	%% 1普通主线
	%% 2家园船副本
	%% 3隐藏副本
	%% 4组队副本
	%% 5活动副本
	%% 6神器副本
	%% 7抢夺
	%% 8大闹天宫
	%% 9竞技场
	%% 10矿洞
	%% 11仙盟副本
	%% 12王者1V1
	%% 13比武（擂台3V3）
	%% 14世界BOSS
	%% 15精英副本
	%% 16
	%% 17法宝精英副本
	%% 108三重天界
	%% 19仙侣副本
	%% 20约会
	%% 21秘境副本加强版（1魔宠副本,2坐骑副本,3翅膀副本，4龙王宝库，5圣物副本，6龙神副本）
	%% 22仙侣2V2
	%% 23镇魔塔（个人天魔）
	%% 24符文塔
	%% 25恶魔广场
	%% 26矮人宝藏
	%% 27埋骨之地（恶魔猎场）
	%% 28精灵宝藏
	%% 29龙神秘典副本
	%% 30转职单人副本
	%% 31转职组队副本
	%% 32守卫战盟
	%% 33战盟争霸
	%% 34XO
	%% 35引导打宝
	%% 36龙神结界
	type,
	%% 来源地图ID
	%% 用来返回进入的恶魔入侵地图
	fromMap
}).

-endif.
