-ifndef(cfg_guardJiBan_hrl).
-define(cfg_guardJiBan_hrl, true).

-record(guardJiBanCfg, {
	%% 羁绊类型
	%% 1.原始羁绊
	%% 2.进阶羁绊
	%% 3.二次进阶羁绊
	%% 4.觉醒羁绊
	%% 5.二次觉醒羁绊
	type,
	%% 羁绊等级
	level,
	%% 索引
	index,
	%% 解锁条件
	%% (条件类型，参数1，参数2)
	%% 条件需同时满足才可解锁
	%% 条件类型1：角色等级，参数-角色等级，0
	%% 条件类型2：转职等级，参数-转职等级，0
	%% 条件类型3：外显激活，参数-外显类型，类型id
	%% 外显类型：1为精灵龙，类型id为精灵龙id
	jiBanConsume,
	%% 羁绊名字
	name,
	%% 羁绊最大等级
	maxLv,
	%% 羁绊数量
	%% 根据羁绊类型确定条件类型
	%% 1.激活的守护数量
	%% 2.进阶1次的守护数量
	%% 3.进阶2次的守护数量
	%% 4.觉醒的守护数量羁绊
	jiBanNum,
	%% 羁绊奖励属性
	%% (属性id，数值)
	attriJiBan
}).

-endif.
