-ifndef(cfg_recovery_hrl).
-define(cfg_recovery_hrl, true).

-record(recoveryCfg, {
	%% 资源找回ID
	iD,
	%% 找回时间（每天二十四点刷新，向前几天的资源可以获取）单位：天
	%% 全局表
	findTime,
	%% 玩法类型
	%% 1.星级副本RecoverStar表
	%% 2.等级副本RecoverLv表
	%% 3.埋骨之地RecoverGhost表
	%% 4.精灵宝库RecoverEif表
	%% 5.特殊玩法RecoverSpecial表
	%% 6.赏金任务RecoverTask表
	%% 7.龙城盛宴RecoverTask表
	findType,
	%% 免费次数单次找回消耗
	%% (消耗类型，消耗道具ID，消耗道具数量)
	%% 消耗类型
	%% 1.为金币消耗
	%% 2.为钻石消耗
	findCost,
	%% 额外次数折扣(万分比)
	findOther,
	%% 次数型消费类型ID（以全局表功能字段为准）
	%% 1代表剧情副本重置
	%% 2代表大闹天宫副本重置
	%% 3英雄重生
	%% 4装备重生
	%% 5摇钱树元宝花费
	%% 6擂台购买次数花费
	%% 7公会副本购买次数花费
	%% 8世界BOSS购买次数花费
	%% 9世界BOSS购买BUFF1-复活
	%% 10世界BOSS购买BUFF2-元宝
	%% 11神器副本购买次数
	%% 12扫荡值购买单位次数花费
	%% 13探索值购买花费
	%% 14.组队副本购买单位次数花费
	%% 15.家园宝箱钥匙购买单次花费
	%% 16.神器强化后继承单次花费
	%% 17.野外复活花费
	%% 18.个人天魔副本购买单次花费
	%% 19.剑台购买次数花费
	%% 20.宠物副本购买次数花费
	%% 21.坐骑副本购买次数花费
	%% 22.翅膀副本购买次数花费
	%% 23.恶魔广场副本购买花费次数
	%% 24.竞技场购买消耗
	%% 25.精灵宝藏购买次数消耗
	%% 26.龙神秘典副本购买次数消耗
	%% 27.埋骨之地副本购买次数消耗
	%% 28.龙王宝库购买次数消耗
	%% 29.圣物副本购买次数消耗
	%% 30.龙神副本购买次数消耗
	%% 31.王者1V1购买次数消耗
	%% 32.情侣试炼购买次数消耗
	%% 实际次数超出配置最大值，按最大值算
	consumptionId,
	%% 只可以找回的类型
	%% 0.金币找回
	%% 1.钻石找回
	recoveryType
}).

-endif.
