-ifndef(cfg_slayUpg_hrl).
-define(cfg_slayUpg_hrl, true).

-record(slayUpgCfg, {
	%% 宠物id
	iD,
	%% 必杀技等级
	level,
	%% 客户端索引
	index,
	%% 技能最大等级
	maxLv,
	%% 升至该等级所需道具
	needItem,
	%% 必杀升级提供固定属性
	attrAdd,
	%% 魔宠技能或修正
	%% (激活条件1,激活参数1,技能类型1,ID1,学习位1)
	%% |(激活条件2,激活参数2,技能类型2,ID2,学习位2)
	%% 激活条件：
	%% 0为不需要条件
	%% 1为宠物等级激活,参数为宠物等级
	%% 技能类型：
	%% 1为技能(skillBase)；2为技能修正(SkillCorr)
	%% 学习位:为0时不可直接获得
	%% 13为魔宠增援技；14为魔宠普攻；
	%% 15为魔宠技能1；16为魔宠技能2
	skill,
	%% 魔宠技能或修正
	%% (激活条件1,激活参数1,技能类型1,ID1,学习位1)
	%% |(激活条件2,激活参数2,技能类型2,ID2,学习位2)
	%% 魔宠升品优化后，根据当前品级替换对应字段的技能
	skill1,
	%% 魔宠技能或修正
	%% (激活条件1,激活参数1,技能类型1,ID1,学习位1)
	%% |(激活条件2,激活参数2,技能类型2,ID2,学习位2)
	%% 魔宠升品优化后，根据当前品级替换对应字段的技能
	skill2,
	%% 魔宠技能或修正
	%% (激活条件1,激活参数1,技能类型1,ID1,学习位1)
	%% |(激活条件2,激活参数2,技能类型2,ID2,学习位2)
	%% 魔宠升品优化后，根据当前品级替换对应字段的技能
	skill3
}).

-endif.
